        
        .org $8000
        
        ;lda #$21
        ;sta $4014
        
        ldx #$11
        stx $2003
        lda #$22
        sta $2004
        
        lda #$55
        stx $2003
        lda $2004
        
        ; --- бинарное сравнение
        
        ; 1000 3E8h
        ; 5000 1388h
        ; 9000 2328h        
        
        lda #$05
        sta $00
        lda #$12
        sta $01

        ; Умножение на 2 и копирование в $02
        asl $00
        rol $01
        
        lda $00
        sta $02
        lda $01
        sta $03
        
        ; Умножение на 4
        asl $00
        rol $01
        asl $00
        rol $01
        
        ; В $00 будет умноженное на 10 число
        clc
        lda $02
        adc $00
        sta $00
        lda $03
        adc $01
        sta $01

INFLP
        jmp INFLP
        
; ----------------------------------------------------------------------
RESET
        lda #$18
        sta $2001       ; Отображать фон и спрайты
        rts
